angular.module('Egerep').service 'SvgMap', ->
    this.map = new SVGMap
        iframeId: 'map',
        clicable: true,
        places: [],
        groups: [{"id":"1","title":"внутри кольца","points":[4,8,12,15,18,19,38,47,48,51,54,56,58,60,63,66,68,71,74,82,83,86,90,91,92,102,104,109,111,120,122,126,129,131,132,133,137,138,140,153,156,157,158,187,188,189,190,191,192,193,194,195,196,198,199]},{"id":"2","title":"красная север","points":[55,106,124,145,154]},{"id":"3","title":"красная юг","points":[33,108,125,148,151,164]},{"id":"4","title":"зеленая север","points":[9,28,29,36,112,123]},{"id":"5","title":"зеленая юг","points":[2,39,44,46,50,53,88,152,197,202,204]},{"id":"6","title":"синяя запад","points":[32,59,62,75,76,77,93,121,127,186,203]},{"id":"7","title":"синяя восток","points":[13,42,94,95,119,161,163]},{"id":"8","title":"голубая","points":[11,62,64,99,128,149,150,186]},{"id":"9","title":"оранжевая север","points":[5,10,20,26,72,113,117]},{"id":"10","title":"оранжевая юг","points":[3,16,43,52,65,84,85,110,135,159,166]},{"id":"11","title":"фиолетовая север","points":[14,87,100,103,130,141,142,162]},{"id":"12","title":"фиолетовая юг","points":[30,35,57,61,107,115,134,205,206]},{"id":"13","title":"желтая","points":[1,81,96,101,114,160,180]},{"id":"14","title":"серая север","points":[6,17,27,37,89,97,116,136]},{"id":"15","title":"серая юг","points":[7,23,45,78,79,80,105,118,139,143,147,155,165]},{"id":"16","title":"светло-зеленая","points":[21,31,41,49,53,57,67,70,98,101,107,114,200,201,202]},{"id":"17","title":"бутовская","points":[22,23,24,84,144,146,147,207,208]},{"id":"18","title":"каховская","points":[25,45,46,118,197]}],

    this.show = (points) ->
        $('#svg-modal').modal('show')
        map = this.map
        map.init()
        map.selected = {}
        map.deselectAll()
        map.select(points)
        $(".legend a").unbind 'click'
        $(".legend a").on 'click', ->
            id = $(this).attr("data-rel")
            map.toggleGroup(id)

    this.save = ->
        $('#svg-modal').modal('hide')
        this.map.save()

    this
