<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;

use App\Http\Requests;
use App\Http\Controllers\Controller;

class CommandsController extends Controller
{
    public function getCalculateShortest()
    {
        //the start and the end
        $a = 1;
        $b = 5;

        //set the distance array
        $_distArr = array();
        $_distArr[1][2] = 7;
        $_distArr[1][3] = 9;
        $_distArr[1][6] = 14;
        $_distArr[2][1] = 7;
        $_distArr[2][3] = 10;
        $_distArr[2][4] = 15;
        $_distArr[3][1] = 9;
        $_distArr[3][2] = 10;
        $_distArr[3][4] = 11;
        $_distArr[3][6] = 2;
        $_distArr[4][2] = 15;
        $_distArr[4][3] = 11;
        $_distArr[4][5] = 6;
        $_distArr[5][4] = 6;
        $_distArr[5][6] = 9;
        $_distArr[6][1] = 14;
        $_distArr[6][3] = 2;
        $_distArr[6][5] = 9;

        //initialize the array for storing
        $S = array();//the nearest path with its parent and weight
        $Q = array();//the left nodes without the nearest path
        foreach(array_keys($_distArr) as $val) $Q[$val] = 99999;
        $Q[$a] = 0;

        //start calculating
        while(!empty($Q)){
            $min = array_search(min($Q), $Q);//the most min weight
            if($min == $b) break;
            foreach($_distArr[$min] as $key=>$val) if(!empty($Q[$key]) && $Q[$min] + $val < $Q[$key]) {
                $Q[$key] = $Q[$min] + $val;
                $S[$key] = array($min, $Q[$key]);
            }
            unset($Q[$min]);
        }

        //list the path
        $path = array();
        $pos = $b;
        while($pos != $a){
            $path[] = $pos;
            $pos = $S[$pos][0];
        }
        $path[] = $a;
        $path = array_reverse($path);

        //print result
        echo "<br />From $a to $b";
        echo "<br />The length is ".$S[$b][1];
        echo "<br />Path is ".implode('->', $path);
    }

    public function getSetMoscowmapId()
    {
        $metro_data = [
            'Алтуфьево'                => 161,
            'Бибирево'                 => 160,
            'Отрадное'                 => 159,
            'Владыкино'                => 158,
            'Менделеевская'            => 153,
            'Петровско-Разумовская'    => 157,
            'Савёловская'              => 154,
            'Дмитровская'              => 155,
            'Тимирязевская'            => 156,
            'Цветной Бульвар'          => 152,
            'Чеховская'                => 151,
            'Боровицкая'               => 150,
            'Полянка'                  => 149,
            'Серпуховская'             => 148,
            'Тульская'                 => 147,
            'Нагатинская'              => 146,
            'Нагорная'                 => 145,
            'Нахимовский проспект'     => 144,
            'Севастопольская'          => 143,
            'Чертановская'             => 142,
            'Южная'                    => 141,
            'Пражская'                 => 140,
            'Улица академика Янгеля'   => 139,
            'Аннино'                   => 138,
            'Бульвар Дмитрия Донского' => 137,
            'Белорусская'              => 84,
            'Новослободская'           => 83,
            'Проспект Мира'            => 82,
            'Комсомольская'            => 81,
            'Курская'                  => 80,
            'Таганская'                => 79,
            'Павелецкая'               => 78,
            'Добрынинская'             => 77,
            'Октябрьская'              => 76,
            'Парк культуры'            => 75,
            'Киевская'                 => 74,
            'Краснопресненская'        => 85,
            'Марьина роща'             => 178,
            'Достоевская'              => 177,
            'Трубная'                  => 176,
            'Сретенский бульвар'       => 175,
            'Чкаловская'               => 174,
            'Римская'                  => 173,
            'Крестьянская застава'     => 172,
            'Дубровка'                 => 171,
            'Кожуховская'              => 170,
            'Печатники'                => 169,
            'Волжская'                 => 168,
            'Люблино'                  => 167,
            'Братиславская'            => 166,
            'Марьино'                  => 165,
            'Борисово'                 => 164,
            'Шипиловская'              => 163,
            'Зябликово'                => 162,
            'Медведково'               => 109,
            'Бабушкинская'             => 108,
            'Свиблово'                 => 107,
            'Ботанический сад'         => 106,
            'ВДНХ'                     => 105,
            'Алексеевская'             => 104,
            'Рижская'                  => 103,
            'Проспект Мира'            => 102,
            'Сухаревская'              => 101,
            'Тургеневская'             => 100,
            'Китай-город'              => 99,
            'Третьяковская'            => 98,
            'Октябрьская'              => 97,
            'Шаболовская'              => 96,
            'Ленинский проспект'       => 95,
            'Академическая'            => 94,
            'Профсоюзная'              => 93,
            'Новые Черёмушки'          => 92,
            'Калужская'                => 91,
            'Беляево'                  => 90,
            'Коньково'                 => 89,
            'Тёплый стан'              => 88,
            'Ясенево'                  => 87,
            'Новоясеневская'           => 86,
            'Речной вокзал'            => 20,
            'Водный стадион'           => 21,
            'Войковская'               => 22,
            'Сокол'                    => 23,
            'Аэропорт'                 => 24,
            'Динамо'                   => 25,
            'Белорусская'              => 26,
            'Маяковская'               => 27,
            'Тверская'                 => 28,
            'Коломенская'              => 33,
            'Технопарк'                => 198,
            'Автозаводская'            => 32,
            'Павелецкая'               => 31,
            'Новокузнецкая'            => 30,
            'Театральная'              => 29,
            'Каширская'                => 34,
            'Кантемировская'           => 35,
            'Царицыно'                 => 36,
            'Орехово'                  => 37,
            'Домодедовская'            => 38,
            'Красногвардейская'        => 39,
            'Алма-Атинская'            => 187,
            'Бульвар Рокоссовского'    => 1,
            'Черкизовская'             => 2,
            'Преображенская площадь'   => 3,
            'Сокольники'               => 4,
            'Красносельская'           => 5,
            'Комсомольская'            => 6,
            'Красные ворота'           => 7,
            'Чистые пруды'             => 8,
            'Лубянка'                  => 9,
            'Охотный ряд'              => 10,
            'Библиотека им.Ленина'     => 11,
            'Кропоткинская'            => 12,
            'Парк культуры'            => 13,
            'Фрунзенская'              => 14,
            'Спортивная'               => 15,
            'Воробьёвы горы'           => 16,
            'Университет'              => 17,
            'Проспект Вернадского'     => 18,
            'Юго-западная'             => 19,
            'Тропарёво'                => 196,
            'Румянцево'                => 199,
            'Саларьево'                => 200,
            'Пятницкое шоссе'          => 188,
            'Митино'                   => 40,
            'Волоколамская'            => 41,
            'Мякинино'                 => 42,
            'Строгино'                 => 43,
            'Крылатское'               => 44,
            'Молодёжная'               => 45,
            'Кунцевская'               => 46,
            'Славянский бульвар'       => 47,
            'Парк Победы'              => 48,
            'Киевская'                 => 49,
            'Смоленская'               => 50,
            'Арбатская'                => 51,
            'Площадь революции'        => 52,
            'Курская'                  => 53,
            'Бауманская'               => 54,
            'Электрозаводская'         => 55,
            'Семёновская'              => 56,
            'Партизанская'             => 57,
            'Измайловская'             => 58,
            'Первомайская'             => 59,
            'Щёлковская'               => 60,
            'Александровский сад'      => 73,
            'Арбатская'                => 72,
            'Смоленская'               => 71,
            'Киевская'                 => 70,
            'Студенческая'             => 67,
            'Кутузовская'              => 66,
            'Фили'                     => 65,
            'Багратионовская'          => 64,
            'Филёвский парк'           => 63,
            'Пионерская'               => 62,
            'Кунцевская'               => 61,
            'Планерная'                => 128,
            'Сходненская'              => 127,
            'Тушинская'                => 126,
            'Спартак'                  => 195,
            'Щукинская'                => 125,
            'Октябрьское поле'         => 124,
            'Полежаевская'             => 123,
            'Беговая'                  => 122,
            'Улица 1905 года'          => 121,
            'Баррикадная'              => 120,
            'Пушкинская'               => 119,
            'Кузнецкий мост'           => 118,
            'Китай-город'              => 117,
            'Таганская'                => 116,
            'Пролетарская'             => 115,
            'Волгоградский проспект'   => 114,
            'Текстильщики'             => 113,
            'Кузьминки'                => 112,
            'Рязанский проспект'       => 111,
            'Выхино'                   => 110,
            'Лермонтовский проспект'   => 190,
            'Жулебино'                 => 189,
            'Котельники'               => 197,
            'Выставочная'              => 69,
            'Международная'            => 68,
            'Новокосино'               => 129,
            'Новогиреево'              => 130,
            'Перово'                   => 131,
            'Шоссе Энтузиастов'        => 132,
            'Авиамоторная'             => 133,
            'Площадь Ильича'           => 134,
            'Марксистская'             => 135,
            'Третьяковская'            => 136,
            'Деловой центр'            => 193,
            'Парк Победы'              => 194,
            'Бунинская аллея'          => 186,
            'Улица Горчакова'          => 185,
            'Бульвар адмирала Ушакова' => 184,
            'Улица Старокачаловская'   => 182,
            'Лесопарковая'             => 192,
            'Битцевский парк'          => 191,
            'Улица Скобелевская'       => 183,
            'Каховская'                => 179,
            'Варшавская'               => 180,
            'Каширская'                => 181,
        ];

        foreach ($metro_data as $title => $id) {
            \DB::connection('egecrm')->update("
                UPDATE stations
                SET moscowmap_id = $id
                WHERE lower(title) = lower('$title')
            ");
        }
    }

    # слияние опыта работы преподов с текушей работой
    public function getMergeTeacherExeprience()
    {
        echo \DB::connection('egecrm')->update("
            UPDATE teachers
            SET experience = concat_ws('\n', experience, current_work)
            WHERE current_work != '' AND experience != ''
         ");

        echo ' | ';

        echo \DB::connection('egecrm')->update("
            UPDATE teachers
            SET experience = current_work
            WHERE current_work != '' AND experience = ''
         ");
    }
}
